# -*- coding: utf-8 -*-
"""
 Программа к учебнику информатики для 10 класса
 К.Ю. Полякова и Е.А. Еремина.
 Глава 8.
 Программа № 35. Сумма и количество элементов массива,
                 удовлетворяющих условию      
 Вход: 
   180 
   185
   170 
   188 
   190
 Результат:
   Элементы 180 < x < 190:
   Количество: 2
   Сумма:      373
   Среднее:    186.5
"""
N = 5
A = [0] * N
print ( "Введите элементы массива:" )
for i in range(N):
  A[i] = int(input())

count = 0 
sum = 0
for i in range(N):
  if 180 < A[i] and A[i] < 190:
    count += 1
    sum += A[i]
   
print ( "Элементы 180 < x < 190:" )
print ( "Количество: ", count ) 
print ( "Сумма:      ", sum )
print ( "Среднее:    ", sum/count )    

