# -*- coding: utf-8 -*-
"""
 Программа к учебнику информатики для 10 класса
 К.Ю. Полякова и Е.А. Еремина.
 Глава 8.
 Программа № 39. Реверс массива
 Вход: 
   1 2 3 4 5
 Результат:
   После реверса:
   [5, 4, 3, 2, 1]
   После реверса:
   [5, 4, 3, 2, 1]
   После реверса:
   [5, 4, 3, 2, 1]
"""
print ( "Введите элементы массива:" )
A0 = list( map(int, input().split()) )
N = len(A0)  

A = A0[:] # копия массива
for i in range(N // 2):
  c = A[i]
  A[i] = A[N-1-i]
  A[N-1-i] = c
print ( "После реверса: " )
print ( A )      

A = A0[:] # копия массива
for i in range(N // 2):
  A[N-1-i],A[i] = A[i],A[N-1-i]
print ( "После реверса: " )
print ( A )      

A = A0[::-1] 
print ( "После реверса: " )
print ( A )      
