# -*- coding: utf-8 -*-
"""
 Программа к учебнику информатики для 10 класса
 К.Ю. Полякова и Е.А. Еремина.
 Глава 8.
 Программа № 49. Разбор строки
 Вход: 
   Василий Алибабаевич Хрюндиков
 Результат:
   Хрюндиков В.А.
   Хрюндиков В.А.
"""
print ( "Введите имя, отчество и фамилию:" )
s0 = input()

s = s0[:]
n = s.find ( " " )
name = s[:n]   	# вырезать имя
s = s[n+1:]
n = s.find ( " " )
name2 = s[:n]   	# вырезать отчество 
s = s[n+1:]      	# осталась фамилия 
s = s + " " +  name[0] + "." + name2[0] + "."
print ( s )

s = s0[:]
fio = s.split()
s = fio[2] + " " + fio[0][0] + "." + fio[1][0] + "."
print ( s )




