# -*- coding: utf-8 -*-
"""
 Программа к учебнику информатики для 10 класса
 К.Ю. Полякова и Е.А. Еремина.
 Глава 8.
 Программа № 50. Преобразования "строка-число"
 Вход: 
   нет
 Результат:
   246
   246.912
   123
     123
   123.456
    123.46
     1.23e+02
"""
s = "123"
N = int ( s )    	# N = 123
print ( N*2 )

s = "123.456"
X = float ( s )    	# X = 123.456
print ( X*2 )

N = 123
s = str ( N )           # s = "123"
print ( s )
s = "{:5d}".format(N)   # s = "  123"
print ( s )

X = 123.456
s = str ( X )           # s = "123.456"
print ( s )
s = "{:7.2f}".format(X)   # s = "◦123.46"
print ( s )
s = "{:10.2e}".format(X)  # s = "◦◦1.23e+02"
print ( s )

